---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.TessellatedFace
source: html/b8311b93-757e-9730-abe3-feb6df90a145.htm
---
# TessellatedFace Members

Constructs a tessellated face without holes. Face data is always set,
 even if the input data are invalid (e.g., describes a wildly non-planar
 face). A TessellatedShepeBuilder's function is used to check
 the data and heal them if possible.